{
  "category": "glassware",
  "category_description": "Functional art, hand-blown by skilled glassworkers. Each piece is unique, beautiful, and made to last.",
  "category_vibe": "These aren't mass-produced. Every swirl, every color shift, every slight variation — that's the human hand at work. This is glass with soul.",
  "products": [
    {
      "id": "glass001",
      "name": "Spiral Galaxy Pipe",
      "description": "A hand-blown glass piece featuring a mesmerizing purple-to-blue spiral that looks like a galaxy caught in glass. Made by a glassblower in Colorado who's been perfecting their craft for 15 years. The spiral isn't just for show — it cools the smoke as it travels. Comes with a cleaning brush and protective pouch.",
      "price_usd": 45.00,
      "image": "https://images.unsplash.com/photo-1582719471137-c3967ffb1c42?w=800",
      "image_description": "A stunning hand-blown glass pipe photographed against a black background with dramatic lighting. The piece features a hypnotic spiral pattern that transitions from deep violet purple at one end through electric blue in the middle to lighter periwinkle at the other end. White and silver swirls accent the spiral, creating a genuine galaxy effect. The glass is thick and substantial - you can tell it's quality work. Light catches differently from each angle, making the colors shimmer and shift like an opal. About 4.5 inches long with a comfortable rounded grip. The bowl is deep and functional. The spiral channel is clearly visible inside, showing this is both art and engineering.",
      "visual_metadata": {
        "primary_colors": ["deep violet", "electric blue", "periwinkle", "silver accents"],
        "style": "cosmic, artistic, premium glasswork",
        "composition": "three-quarter view on black, dramatic studio lighting",
        "mood": "mesmerizing, psychedelic, quality craftsmanship"
      },
      "tags": ["hand-blown", "functional art", "durable", "Colorado made", "unique"],
      "origin": "Boulder, Colorado, USA",
      "tone_hint": "This is functional art. Talk about the craftsmanship, the way the colors shift in different light, the satisfaction of owning something truly one-of-a-kind.",
      "features": ["borosilicate glass", "spiral cooling design", "comfortable grip", "easy to clean", "includes protective pouch"],
      "dimensions": "4.5 inches long, 1.5 inches wide",
      "care": "Clean with isopropyl alcohol and salt. Avoid extreme temperature changes.",
      "perfect_for": ["daily use", "conversations about art", "appreciating craftsmanship", "solo sessions", "showing off to friends"]
    },
    {
      "id": "glass002",
      "name": "Sunset Mesa Bubbler",
      "description": "A compact water bubbler with burnt orange and gold swirls that catch the light like desert sunsets. The chamber is shaped like a mesa, and the whole thing fits comfortably in your palm. Handmade in New Mexico, each one is slightly different. This one's got a personality.",
      "price_usd": 68.00,
      "image": "https://images.unsplash.com/photo-1610650873125-7aea58abb9b6?w=800",
      "image_description": "A compact, beautifully crafted glass water bubbler sitting on desert sand with a Southwestern sunset backdrop. The glass features warm swirls of burnt orange, amber gold, and deep rust red that genuinely look like a New Mexico sunset. The chamber is wide and flat on top like a mesa plateau. The base is stable and weighted. Water chamber is visible through the translucent glass, showing how the water filtration works. The mouthpiece curves elegantly. About the size of your palm - portable but substantial. Photographed in golden hour light that makes the orange glass absolutely glow. Red rock formations blur in the background.",
      "visual_metadata": {
        "primary_colors": ["burnt orange", "amber gold", "rust red", "translucent honey"],
        "style": "Southwestern, compact, artisan",
        "composition": "desert setting with sunset lighting",
        "mood": "warm, earthy, portable elegance"
      },
      "tags": ["water pipe", "hand-blown", "compact", "New Mexico", "artisan"],
      "origin": "Santa Fe, New Mexico, USA",
      "tone_hint": "Describe it like holding a sunset in your hand. It's portable art that performs beautifully.",
      "features": ["water filtration", "compact size", "stable base", "deep bowl", "thick glass construction"],
      "dimensions": "5 inches tall, 3 inches wide",
      "care": "Change water regularly, clean with specialized glass cleaner or alcohol solution.",
      "perfect_for": ["smooth hits", "travel", "small spaces", "water filtration fans", "art collectors"]
    },
    {
      "id": "glass003",
      "name": "Celestial Chillum",
      "description": "Simple, elegant, timeless. A straight chillum with tiny stars embedded in clear glass, made by a family workshop in India that's been crafting these for generations. This is old-school cool, perfect for anyone who appreciates minimalist function and cultural tradition.",
      "price_usd": 22.00,
      "image": "https://images.unsplash.com/photo-1519074069444-1ba4fff66d16?w=800",
      "image_description": "An elegant straight glass chillum photographed on a dark velvet surface with a starry night sky projected behind it. The piece is crystal clear glass - almost invisible except for tiny silver stars embedded throughout, like capturing the night sky in glass. The stars catch light and twinkle. It's simple and sophisticated - no colors, no swirls, just pure form and subtle detail. Traditional straight design, smooth finish. About 4 inches long and slim enough to fit in a pocket. A small silver band wraps one end. The minimalism is the statement. Lit to emphasize the stars twinkling inside the glass.",
      "visual_metadata": {
        "primary_colors": ["crystal clear", "silver stars", "deep black background"],
        "style": "minimalist, traditional, celestial",
        "composition": "straight-on with starry backdrop",
        "mood": "elegant, simple, timeless"
      },
      "tags": ["traditional", "minimalist", "hand-blown", "India", "classic"],
      "origin": "Jaipur, India",
      "tone_hint": "This is a classic piece with roots in tradition. Talk about its simplicity, its history, its no-nonsense functionality.",
      "features": ["straight design", "embedded star pattern", "smooth finish", "traditional style", "pocket-friendly"],
      "dimensions": "4 inches long, 0.75 inches wide",
      "care": "Soak in alcohol, use pipe cleaners to remove residue.",
      "perfect_for": ["purists", "on-the-go", "minimalists", "honoring tradition", "straightforward sessions"]
    },
    {
      "id": "glass004",
      "name": "Forest Spirit Bong",
      "description": "A larger water bong with green and amber glass that looks like light filtering through a forest canopy. Three-inch base for stability, ice catch for extra cooling, and a removable downstem for easy cleaning. Made by a collective of glassblowers in Oregon who donate part of their proceeds to reforestation efforts.",
      "price_usd": 120.00,
      "image": "https://images.unsplash.com/photo-1541363748108-17e69a9c9c6d?w=800",
      "image_description": "A substantial 12-inch tall glass bong photographed in a forest setting with dappled sunlight. The glass swirls with forest greens - from deep emerald to bright lime - mixed with golden amber that looks exactly like sunlight through leaves. The beaker base is wide and stable. Ice catch notches are visible inside the chamber. The downstem is removable for easy cleaning. Thick, quality borosilicate construction. The green and gold colors genuinely evoke being in a forest. Photographed outdoors with moss and ferns around the base, actual tree canopy bokeh in background. A small wooden tag hangs from it showing the reforestation initiative.",
      "visual_metadata": {
        "primary_colors": ["emerald green", "forest green", "golden amber", "clear glass"],
        "style": "natural, substantial, eco-conscious",
        "composition": "forest setting with natural lighting",
        "mood": "grounded, quality, purposeful"
      },
      "tags": ["water pipe", "ice catch", "stable", "eco-conscious", "Oregon made"],
      "origin": "Eugene, Oregon, USA",
      "tone_hint": "This is a statement piece — beautiful, functional, and connected to a bigger purpose. Emphasize the quality and the environmental giving.",
      "features": ["12-inch height", "ice catch", "removable downstem", "stable beaker base", "reinforced mouthpiece", "proceeds support reforestation"],
      "dimensions": "12 inches tall, 4 inches base diameter",
      "care": "Regular cleaning recommended. Use isopropyl alcohol and coarse salt.",
      "perfect_for": ["home use", "group sessions", "smooth cooled hits", "eco-conscious buyers", "serious collectors"]
    },
    {
      "id": "glass005",
      "name": "Moonstone One-Hitter",
      "description": "A tiny glass one-hitter with milky white glass that shimmers like moonstone. Fits in a dugout or your pocket. Made by a micro-studio in California, each piece is hand-painted with a tiny crescent moon. Discreet, elegant, and perfect for microdosing or solo adventures.",
      "price_usd": 15.00,
      "image": "https://images.unsplash.com/photo-1511376777868-611b54f68947?w=800",
      "image_description": "A delicate one-hitter barely three inches long, photographed on a white marble surface under moonlight. The glass is milky white with an opalescent shimmer - it genuinely looks like polished moonstone. A tiny hand-painted silver crescent moon adorns one side. So small and elegant it could be mistaken for a fancy pen or art piece. The finish is smooth and slightly frosted. Soft blue-white lighting emphasizes the ethereal quality. A few small crystals (real moonstone and selenite) are arranged artfully nearby. The whole image whispers 'discreet elegance'.",
      "visual_metadata": {
        "primary_colors": ["milky white", "opalescent shimmer", "silver moon detail"],
        "style": "delicate, discreet, ethereal",
        "composition": "minimal styling on marble with moon lighting",
        "mood": "elegant, subtle, mystical"
      },
      "tags": ["one-hitter", "discreet", "hand-painted", "California", "portable"],
      "origin": "San Francisco, California, USA",
      "tone_hint": "Small but mighty. Talk about discretion, elegance, and the beauty of simplicity.",
      "features": ["pocket-sized", "hand-painted moon detail", "dugout compatible", "easy to conceal", "quick sessions"],
      "dimensions": "3 inches long, 0.5 inches wide",
      "care": "Soak and clean regularly to prevent clogging.",
      "perfect_for": ["microdosing", "discretion", "hiking", "concerts", "quick solo sessions"]
    },
    {
      "id": "glass006",
      "name": "Rainbow Prism Spoon",
      "description": "A classic spoon pipe with dichroic glass that shifts through every color of the rainbow depending on how the light hits it. It's like holding a prism. Made in Vermont by an artist who only works with the highest quality borosilicate glass. This piece is durable, functional, and mesmerizing.",
      "price_usd": 38.00,
      "image": "https://images.unsplash.com/photo-1535478044878-3ed83d5456ef?w=800",
      "image_description": "A classic spoon-shaped glass pipe on a white background, photographed with multiple light sources to show the dichroic effect. The glass shifts through the entire rainbow - you can see different colors from different angles: magenta to turquoise to gold to green. It's genuinely prismatic, like captured light. The spoon shape is ergonomic and comfortable. Carb hole visible on the side. Thick walls show quality construction. The rainbow effect is captured with split lighting - one side showing purple/blue tones, the other showing gold/green tones. A few rainbow light reflections dance on the white surface below. This piece is pure visual magic.",
      "visual_metadata": {
        "primary_colors": ["full rainbow spectrum", "dichroic multicolor", "color-shifting"],
        "style": "prismatic, classic form, psychedelic",
        "composition": "split lighting to show color shift",
        "mood": "mesmerizing, joyful, functional art"
      },
      "tags": ["dichroic glass", "rainbow", "classic spoon", "Vermont", "durable"],
      "origin": "Burlington, Vermont, USA",
      "tone_hint": "This is pure visual magic. Emphasize how the colors shift and change, how it's functional art you'll never get tired of looking at.",
      "features": ["dichroic color-shifting glass", "classic spoon shape", "carb hole", "comfortable grip", "thick walls"],
      "dimensions": "4 inches long, 2 inches wide",
      "care": "Clean regularly with alcohol and salt to maintain color brilliance.",
      "perfect_for": ["color enthusiasts", "reliable daily use", "catching compliments", "appreciating light and color", "gift-giving"]
    }
  ]
}