{
  "category": "incense",
  "category_description": "Hand-rolled incense from artisans around the world. Each stick is a journey, a ritual, a moment to breathe.",
  "category_vibe": "These aren't just scents — they're portals to different states of mind. Light one up during meditation, creative work, or when you just need to shift the energy in a space.",
  "products": [
    {
      "id": "incense001",
      "name": "Galactic Sandalwood",
      "description": "Hand-rolled in the foothills of Nepal, these incense sticks blend pure sandalwood with Himalayan herbs and a whisper of sacred resins. The packaging is recycled paper painted with starlight motifs by local artists. Each stick burns for about 45 minutes, filling your space with grounding, meditative warmth.",
      "price_usd": 9.99,
      "image": "https://images.unsplash.com/photo-1608571423902-eed4a5ad8108?w=800",
      "image_description": "A bundle of 20 hand-rolled incense sticks wrapped in recycled kraft paper. The packaging features hand-painted starlight motifs - tiny galaxies, stars, and constellations scattered across the wrapper in deep indigo and metallic silver. The sticks themselves peek out from the top, showing their warm honey-brown color from the sandalwood. A small hemp string ties the bundle together. The overall aesthetic is earthy meets cosmic - natural materials with mystical artwork that looks like it was painted by someone under a starry Himalayan sky.",
      "visual_metadata": {
        "primary_colors": ["honey brown", "deep indigo", "metallic silver", "natural kraft"],
        "style": "hand-painted, artisanal, cosmic",
        "composition": "bundle wrapped in decorated paper, tied with hemp string",
        "mood": "mystical, grounded, handcrafted"
      },
      "tags": ["aromatherapy", "sustainable", "relaxation", "sandalwood", "meditation"],
      "origin": "Kathmandu, Nepal",
      "tone_hint": "Describe it like something you'd burn while meditating under a full moon or watching galaxies spin.",
      "ingredients": ["sandalwood powder", "Himalayan herbs", "natural resins", "bamboo core"],
      "burn_time": "45 minutes per stick",
      "quantity": "20 sticks per bundle",
      "perfect_for": ["meditation", "yoga", "deep work", "stargazing", "ritual space clearing"]
    },
    {
      "id": "incense002",
      "name": "Desert Sage & Copal",
      "description": "A collaboration with a women's collective in New Mexico. Wild-harvested desert sage meets Mexican copal resin, creating a sacred smoke that's been used in ceremonies for centuries. This isn't your average incense — it's the real deal. Earthy, resinous, and deeply cleansing.",
      "price_usd": 12.99,
      "image": "https://images.unsplash.com/photo-1611689037241-d8f7b4d0f8db?w=800",
      "image_description": "Thick, rustic incense sticks in natural browns and sage-greens, bundled together with woven desert grass. The packaging is simple burlap tied with turquoise-colored cord - very Southwestern aesthetic. You can see bits of actual sage leaves and amber-colored copal resin embedded in the sticks. The presentation feels ceremonial and authentic, like something you'd find at a Native American art market. No flashy graphics, just honest materials and traditional craftsmanship.",
      "visual_metadata": {
        "primary_colors": ["sage green", "earth brown", "amber", "turquoise accent"],
        "style": "ceremonial, rustic, Southwestern",
        "composition": "bundle wrapped in burlap with woven grass ties",
        "mood": "sacred, authentic, grounded"
      },
      "tags": ["ceremonial", "cleansing", "sustainable", "sage", "copal"],
      "origin": "New Mexico, USA & Oaxaca, Mexico",
      "tone_hint": "This is sacred smoke, ceremony-grade. Talk about it with reverence — it's been used in healing rituals for generations.",
      "ingredients": ["wild desert sage", "copal resin", "makko powder", "cedar base"],
      "burn_time": "60 minutes per stick",
      "quantity": "15 sticks per bundle",
      "perfect_for": ["space clearing", "ceremony", "new beginnings", "releasing old energy", "connecting with ancestors"]
    },
    {
      "id": "incense003",
      "name": "Lavender Dreams",
      "description": "Organic French lavender blended with chamomile and a hint of vanilla. Hand-rolled by a family in Provence who've been crafting incense for three generations. This one's for winding down — perfect for evening rituals, journaling, or just getting cozy.",
      "price_usd": 8.99,
      "image": "https://images.unsplash.com/photo-1595815771614-ade9d652a65d?w=800",
      "image_description": "Delicate lavender-purple incense sticks arranged in a clear glass holder on a white surface. The sticks are thin and elegant, with a soft purple hue throughout. Surrounding them are fresh lavender sprigs and dried chamomile flowers, emphasizing the natural ingredients. The lighting is soft and dreamy - golden hour sunlight filtering through, creating a peaceful, spa-like atmosphere. A small cream-colored tag hangs from the bundle with 'Lavande de Provence' written in flowing script. Everything about the image whispers 'relax'.",
      "visual_metadata": {
        "primary_colors": ["lavender purple", "cream", "soft gold", "white"],
        "style": "spa-like, elegant, natural",
        "composition": "glass holder with fresh lavender sprigs as props",
        "mood": "peaceful, soothing, gentle"
      },
      "tags": ["relaxation", "sleep", "organic", "lavender", "calming"],
      "origin": "Provence, France",
      "tone_hint": "Think: lavender fields at sunset, a warm bath, the softest blanket. This is comfort in smoke form.",
      "ingredients": ["organic lavender", "chamomile", "vanilla essence", "bamboo core"],
      "burn_time": "40 minutes per stick",
      "quantity": "20 sticks per bundle",
      "perfect_for": ["bedtime rituals", "relaxation", "anxiety relief", "creating safe space", "gentle unwinding"]
    },
    {
      "id": "incense004",
      "name": "Palo Santo & Frankincense",
      "description": "Sustainably harvested Palo Santo from Ecuador mixed with ancient frankincense resin. The Palo Santo comes from naturally fallen trees, blessed by local shamans. This is high-vibe smoke — uplifting, clarifying, and perfect for setting intentions.",
      "price_usd": 14.99,
      "image": "https://images.unsplash.com/photo-1602070430008-120f484f61e8?w=800",
      "image_description": "Premium incense sticks that look almost like small pieces of sacred wood. Light honey-gold color with visible wood grain texture and tiny amber resin crystals embedded throughout. Packaged in a handmade bamboo box with a sliding lid, etched with geometric patterns. A small card explains the sustainable harvesting and shaman blessings. The overall presentation is elevated and intentional - this looks and feels like a spiritual tool, not just incense. Photographed on a dark wooden altar with crystals and a singing bowl nearby, emphasizing its ceremonial use.",
      "visual_metadata": {
        "primary_colors": ["honey gold", "amber", "natural bamboo", "dark wood"],
        "style": "ceremonial, premium, sacred",
        "composition": "bamboo box on altar with spiritual props",
        "mood": "uplifting, powerful, intentional"
      },
      "tags": ["uplifting", "sacred", "sustainable", "palo santo", "frankincense"],
      "origin": "Ecuador & Oman",
      "tone_hint": "This is the incense shamans and mystics reach for. Talk about it like liquid sunshine meets ancient wisdom.",
      "ingredients": ["palo santo", "frankincense resin", "natural binders", "bamboo core"],
      "burn_time": "50 minutes per stick",
      "quantity": "12 sticks per bundle",
      "perfect_for": ["manifestation", "intention setting", "creative breakthroughs", "spiritual practice", "raising vibrations"]
    },
    {
      "id": "incense005",
      "name": "Cannabis & Patchouli",
      "description": "Let's be real — this is the classic headshop scent, reimagined. Hemp flower and earthy patchouli rolled with rose petals and a touch of amber. No THC, just the nostalgic aroma of good times and festival memories. Made by herbalists in Oregon who know what's up.",
      "price_usd": 10.99,
      "image": "https://images.unsplash.com/photo-1609187839622-e0e6d30c9d67?w=800",
      "image_description": "Earthy green-brown incense sticks with visible hemp flower and rose petal pieces pressed into them. The bundle is wrapped in tie-dye fabric in classic 60s colors - purple, orange, and green swirls. A hemp leaf charm dangles from the tie. The aesthetic is unapologetically hippie - peace signs, good vibes, festival energy. Photographed on a vintage wooden table next to a vinyl record player and some old concert posters. This is nostalgia incarnate.",
      "visual_metadata": {
        "primary_colors": ["forest green", "earth brown", "tie-dye rainbow", "hemp natural"],
        "style": "hippie, retro, festival",
        "composition": "tie-dye wrapped bundle with vintage props",
        "mood": "nostalgic, chill, groovy"
      },
      "tags": ["earthy", "nostalgic", "hemp", "patchouli", "festival vibes"],
      "origin": "Portland, Oregon, USA",
      "tone_hint": "This one brings the classic headshop energy. It's nostalgic, a little rebellious, and unapologetically earthy.",
      "ingredients": ["hemp flower", "patchouli", "rose petals", "amber resin", "bamboo core"],
      "burn_time": "45 minutes per stick",
      "quantity": "20 sticks per bundle",
      "perfect_for": ["creating atmosphere", "reminiscing", "drum circles", "creative hangs", "embracing your inner hippie"]
    }
  ]
}