{
  "category": "tapestries",
  "category_description": "Wall hangings that transform spaces and shift energy. Each one is a portal to somewhere else.",
  "category_vibe": "Tapestries aren't just decoration — they're instant atmosphere. Hang one up and suddenly your room feels like a meditation temple, a desert oasis, or a cosmic observatory.",
  "products": [
    {
      "id": "tapestry001",
      "name": "Starmap of the Ancients",
      "description": "A deep indigo tapestry printed with a hand-drawn star map showing constellations as ancient cultures saw them — not just the Greek names we know, but Aboriginal, Chinese, and Arabic star stories too. It glows softly under blacklight. Large enough to cover a wall or use as a ceiling canopy.",
      "price_usd": 39.99,
      "image": "https://images.unsplash.com/photo-1419242902214-272b3f66ee7a?w=800",
      "image_description": "A large deep indigo tapestry hanging on a white wall, photographed in a dimly lit room with blacklight illumination. The star map glows ethereally - constellations connected by golden lines, each labeled in different scripts (Greek, Arabic, Chinese characters, Aboriginal symbols). The background is a gradient from midnight blue to deep purple. Stars are rendered in white and gold, with major stars larger and brighter. Different cultural constellation interpretations overlap, showing how various peoples saw patterns in the same sky. The fabric is rich organic cotton with reinforced edges and loops at top. Under the blacklight, certain elements fluoresce softly. Room has ambient candles and a meditation cushion, emphasizing its use in contemplative spaces.",
      "visual_metadata": {
        "primary_colors": ["deep indigo", "midnight blue", "golden yellow", "white stars"],
        "style": "educational, multicultural, cosmic",
        "composition": "wall-mounted with blacklight effect",
        "mood": "contemplative, mystical, educational"
      },
      "tags": ["celestial", "educational", "blacklight reactive", "large", "multicultural"],
      "origin": "Designed in California, printed on organic cotton in India",
      "tone_hint": "This is a cosmic classroom on your wall. Talk about how it connects different cultures' relationships with the night sky.",
      "features": ["blacklight reactive ink", "organic cotton", "reinforced edges", "multiple hanging loops", "machine washable"],
      "dimensions": "90 x 60 inches",
      "material": "100% organic cotton",
      "perfect_for": ["stargazers", "meditation spaces", "learning constellations", "blacklight vibes", "cultural appreciation"]
    },
    {
      "id": "tapestry002",
      "name": "Desert Mandala",
      "description": "A circular mandala in warm desert tones — burnt orange, terracotta, sage, and sand. The pattern radiates from a central eye, drawing you inward. Hand-printed by artisans in Rajasthan using traditional block-printing techniques that have been passed down for centuries.",
      "price_usd": 44.99,
      "image": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?w=800",
      "image_description": "A square tapestry dominated by an intricate circular mandala in warm Southwestern colors. The center features a detailed eye surrounded by layers of geometric patterns - circles, petals, triangles - all radiating outward like ripples. Colors transition from deep terracotta in the center through burnt orange, rust red, sage green, to sandy beige at the edges. You can see the hand-block-printed texture - slight variations and natural dye irregularities that prove human craftsmanship. The fabric is cotton with a soft, lived-in feel. Photographed hanging on an adobe wall with morning sunlight casting soft shadows that emphasize the texture. A wooden meditation bench and potted succulent nearby.",
      "visual_metadata": {
        "primary_colors": ["burnt orange", "terracotta", "sage green", "sandy beige"],
        "style": "traditional Rajasthani, hand-printed, meditative",
        "composition": "centered on textured wall with natural light",
        "mood": "centering, warm, handcrafted"
      },
      "tags": ["mandala", "hand-printed", "traditional", "meditation", "Rajasthan"],
      "origin": "Jaipur, Rajasthan, India",
      "tone_hint": "This is meditation made visual. Talk about the centering effect of the mandala, the craftsmanship of block printing, the warmth of the colors.",
      "features": ["hand block-printed", "vegetable dyes", "cotton blend", "symmetrical pattern", "hanging tabs included"],
      "dimensions": "84 x 84 inches (square)",
      "material": "Cotton blend with natural dyes",
      "perfect_for": ["meditation corners", "yoga studios", "creating focal points", "grounding energy", "supporting traditional crafts"]
    },
    {
      "id": "tapestry003",
      "name": "Mushroom Forest Portal",
      "description": "An otherworldly forest scene filled with oversized mushrooms, luminescent moss, and hidden fairy doors. The colors are rich and saturated — deep greens, purples, and bioluminescent blues. It's like looking into another dimension. Perfect for anyone who loves fantasy, nature, or just wants their room to feel magical.",
      "price_usd": 36.99,
      "image": "https://images.unsplash.com/photo-1518837695005-2083093ee35b?w=800",
      "image_description": "A vibrant fantasy tapestry showing a magical mushroom forest. Giant toadstools with red and purple caps tower in the foreground, some as tall as trees. Bioluminescent blue moss glows on tree trunks. Tiny fairy doors are hidden in tree hollows. The forest floor is covered in smaller mushrooms in every color - orange, yellow, teal. Fireflies (or are they fairies?) float through the scene. The color palette is incredibly saturated and dreamlike - deep emerald greens, rich purples, electric blues, with pops of orange and pink. The artwork style is detailed digital illustration printed on soft polyester. Hanging in a bedroom with string lights, creating an immersive fantasy atmosphere.",
      "visual_metadata": {
        "primary_colors": ["emerald green", "deep purple", "electric blue", "vibrant orange"],
        "style": "fantasy illustration, whimsical, saturated",
        "composition": "immersive bedroom setting with ambient lighting",
        "mood": "magical, playful, escapist"
      },
      "tags": ["fantasy", "nature", "psychedelic", "whimsical", "vibrant"],
      "origin": "Designed by a digital artist in Portland, printed on recycled polyester",
      "tone_hint": "This is pure escapism. Talk about the sense of wonder, the portal-to-another-world vibe, the joy of surrounding yourself with magic.",
      "features": ["vivid colors", "recycled polyester", "lightweight", "wrinkle-resistant", "easy hanging"],
      "dimensions": "80 x 60 inches",
      "material": "Recycled polyester",
      "perfect_for": ["fantasy lovers", "creating immersive spaces", "dorm rooms", "festival decor", "playful energy"]
    },
    {
      "id": "tapestry004",
      "name": "Sacred Geometry Grid",
      "description": "Black background with metallic gold sacred geometry — the Flower of Life, Metatron's Cube, and interlocking patterns that seem to pulse with mathematical harmony. This one's for the people who see the code underlying reality. Printed with metallic ink that catches light beautifully.",
      "price_usd": 42.99,
      "image": "https://images.unsplash.com/photo-1550859492-d5da9d8e45f3?w=800",
      "image_description": "A striking black tapestry with precise metallic gold sacred geometry patterns. The centerpiece is a large Flower of Life pattern, surrounded by Metatron's Cube, Sri Yantra, and other interlocking geometric forms. The gold ink is actually metallic and catches light dramatically - sometimes glowing bright, sometimes subtle depending on angle. The precision is mathematical - perfect circles, exact symmetry. Against the deep black background, the gold seems to float. Photographed in a modern minimalist space with a single spotlight creating dramatic shadows. The metallic print has actual dimensional texture you can see. Very modern spiritual aesthetic - clean, powerful, geometric.",
      "visual_metadata": {
        "primary_colors": ["deep black", "metallic gold", "dimensional shine"],
        "style": "modern spiritual, mathematical, striking",
        "composition": "dramatic lighting emphasizing metallic effect",
        "mood": "powerful, precise, contemplative"
      },
      "tags": ["sacred geometry", "metallic", "mathematical", "modern", "striking"],
      "origin": "Designed in Colorado, printed on organic cotton in USA",
      "tone_hint": "This is the universe's blueprint on your wall. Talk about sacred geometry as the language of creation, the visual satisfaction of perfect symmetry.",
      "features": ["metallic gold ink", "organic cotton", "precise geometric patterns", "light-catching finish", "durable construction"],
      "dimensions": "72 x 48 inches",
      "material": "Organic cotton with metallic ink",
      "perfect_for": ["geometry enthusiasts", "modern spiritual spaces", "focus and meditation", "visual learners", "mathematical minds"]
    },
    {
      "id": "tapestry005",
      "name": "Ocean Wisdom",
      "description": "An underwater scene with a wise old sea turtle swimming through shafts of sunlight, surrounded by schools of fish and swaying kelp. The colors are peaceful blues and greens. This one brings the ocean's calm energy into your space. A portion of proceeds goes to ocean conservation efforts.",
      "price_usd": 38.99,
      "image": "https://images.unsplash.com/photo-1583212292454-1fe6229603b7?w=800",
      "image_description": "A serene underwater scene tapestry in calming blues and greens. An ancient sea turtle glides through the center, rays of golden sunlight streaming from the surface above. The turtle's shell is detailed and weathered - you can feel its age and wisdom. Schools of small tropical fish in yellows and blues surround it. Long strands of kelp sway in the current at the edges. The water color gradients from deep teal at the bottom to bright turquoise near the surface light. Bubbles float upward. The overall effect is deeply peaceful and meditative. Hanging in a yoga studio with natural light, creating a genuinely calming atmosphere. A small tag mentions ocean conservation donations.",
      "visual_metadata": {
        "primary_colors": ["deep teal", "turquoise", "ocean blue", "golden sunlight"],
        "style": "naturalistic, peaceful, conservation-focused",
        "composition": "yoga studio setting emphasizing calm",
        "mood": "peaceful, wise, meditative"
      },
      "tags": ["ocean", "sea turtle", "peaceful", "conservation", "calming"],
      "origin": "Designed in Hawaii, printed on sustainable fabric",
      "tone_hint": "This brings ocean energy inland. Talk about the calming effect of water imagery, the wisdom of ancient creatures, the connection to conservation.",
      "features": ["eco-friendly printing", "soft fabric", "ocean conservation donation", "fade-resistant", "calming color palette"],
      "dimensions": "88 x 60 inches",
      "material": "Sustainable fabric blend",
      "perfect_for": ["ocean lovers", "calming spaces", "supporting conservation", "meditation", "bringing nature indoors"]
    },
    {
      "id": "tapestry006",
      "name": "Vintage Zodiac Wheel",
      "description": "A vintage-style zodiac wheel with all twelve signs illustrated in an Art Nouveau style. Muted earth tones and celestial symbols create a mystical, timeless feel. Hand-drawn by an astrologer and artist in New Orleans who poured years of study into every detail.",
      "price_usd": 46.99,
      "image": "https://images.unsplash.com/photo-1532693322450-2cb5c511067d?w=800",
      "image_description": "A square tapestry featuring an ornate circular zodiac wheel in vintage Art Nouveau style. All twelve zodiac signs are illustrated with flowing, organic lines - Aries ram, Taurus bull, Gemini twins, etc. Each sign is in its own segment with corresponding constellation, symbol, and dates. The color palette is muted and sophisticated - dusty rose, sage green, antique gold, cream, and soft brown. Celestial elements (moon phases, stars, planets) decorate the outer ring. The center features a sun and moon in embrace. The whole design has an aged, vintage quality like an antique astrological chart. Hanging in a mystical New Orleans-style room with crystals, tarot cards, and vintage furniture. The aesthetic is occult parlor meets bohemian artist studio.",
      "visual_metadata": {
        "primary_colors": ["dusty rose", "sage green", "antique gold", "cream", "soft brown"],
        "style": "Art Nouveau, vintage occult, detailed illustration",
        "composition": "mystical room setting with occult props",
        "mood": "mystical, vintage, knowledgeable"
      },
      "tags": ["astrology", "zodiac", "vintage style", "mystical", "educational"],
      "origin": "Designed in New Orleans, printed on organic cotton",
      "tone_hint": "This is astrology as art. Perfect for anyone who takes their star chart seriously or just loves the aesthetic of cosmic wisdom.",
      "features": ["all 12 zodiac signs", "Art Nouveau styling", "organic cotton", "detailed illustrations", "vintage color palette"],
      "dimensions": "80 x 80 inches (square)",
      "material": "100% organic cotton",
      "perfect_for": ["astrology enthusiasts", "vintage aesthetic lovers", "learning the zodiac", "mystical decor", "conversation starters"]
    }
  ]
}